app/controllers/users_controller.rb

INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Tim"], ["password_digest", "$2a$10$ipPOwAdYK.stWZalB6A5rOSDxnX26MVngNW/Hf4clEolhQQoxBlh."], ["created_at", "2018-03-15 11:53:41.378007"], ["updated_at", "2018-03-15 11:53:41.378007"]]
---
  def create
    user = User.new(user_params)
    if user.save